sky-mart/bazel-stm32/apps/sdcard/main.cpp
#include "stm32f3xx_hal.h"
#include "bsp/sdcard/sdcard.h"
#include "bsp/stm32f3discovery/gyroscope.h"
#include "bsp/utility/utility.h"
#include "ff.h"

#include <cstdio>
#include <cstring>

using namespace mart;

Sdcard sdcard{SPI1, Pin{GPIOE, GPIO_PIN_5}};
FATFS fs;

void error_handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

int main()
{
  HAL_Init();

  __HAL_RCC_SPI1_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOE_CLK_ENABLE();

  stm32f3discovery::Gyroscope gyro;
  gyro.unselect();

  // Sdcard sdcard{SPI1, Pin{GPIOE, GPIO_PIN_5}};

  const int sdcard_res = sdcard.init(Pin{GPIOA, GPIO_PIN_5}, Pin{GPIOA, GPIO_PIN_6}, Pin{GPIOA, GPIO_PIN_7}, GPIO_AF5_SPI1);
  if (sdcard_res < 0)
  {
    error_handler();
  }

  FRESULT fat_res = f_mount(&fs, "", 0);
  if (fat_res != FR_OK)
  {
    error_handler();
  }

  uint32_t free_clust;
  FATFS* fs_ptr = &fs;
  fat_res = f_getfree("", &free_clust, &fs_ptr); // Warning! This fills fs.n_fatent and fs.csize!
  if (fat_res != FR_OK)
  {
    error_handler();
  }

  DIR dir;
  fat_res = f_opendir(&dir, "/");
  if (fat_res != FR_OK)
  {
    error_handler();
  }

  FILINFO fileInfo;
  uint32_t totalFiles = 0;
  uint32_t totalDirs = 0;
  for(;;) {
    fat_res = f_readdir(&dir, &fileInfo);
    if ((fat_res != FR_OK) || (fileInfo.fname[0] == '\0')) {
      break;
    }

    if(fileInfo.fattrib & AM_DIR) {
      totalDirs++;
    } else {
      totalFiles++;
    }
  }

  fat_res = f_closedir(&dir);
  if (fat_res != FR_OK)
  {
    error_handler();
  }


  /*uint32_t blocks_number;
  res = sdcard.get_blocks_number(&blocks_number);
  if (res < 0)
  {
    error_handler();
  }

  const uint32_t start_block_addr = 0x00ABCD;
  uint32_t block_addr = start_block_addr;
  uint8_t block[512];

  snprintf((char*)block, sizeof(block), "0x%08X", (int)block_addr);

  res = sdcard.write_single_block(block_addr, block);
  if (res < 0)
  {
    error_handler();
  }

  memset(block, 0, sizeof(block));

  res = sdcard.read_single_block(block_addr, block);
  if (res < 0)
  {
    error_handler();
  }

  block_addr = start_block_addr + 1;
  res = sdcard.write_begin(block_addr);
  if (res < 0)
  {
    error_handler();
  }

  for(int i = 0; i < 3; i++)
  {
    snprintf((char*)block, sizeof(block), "0x%08X", (int)block_addr);

    res = sdcard.write_data(block);
    if (res < 0)
    {
      error_handler();
    }

    block_addr++;
  }

  res = sdcard.write_end();
  if (res < 0)
  {
    error_handler();
  }

  block_addr = start_block_addr + 1;
  res = sdcard.read_begin(block_addr);
  if (res < 0)
  {
    error_handler();
  }

  for(int i = 0; i < 3; i++)
  {
    res = sdcard.read_data(block);
    if (res < 0)
    {
      error_handler();
    }
  }

  res = sdcard.read_end();
  if (res < 0)
  {
    error_handler();
  }*/

  while (true)
  {
  }
}
